In [23]:
import os

In [5]:
import pandas as pd

In [24]:
os.chdir(r'C:\Users\shmi2002\OneDrive')

In [25]:
os.getcwd()

'C:\\Users\\shmi2002\\OneDrive'

In [6]:
pd.read_excel(r'C:\Users\shmi2002\Documents\python data set\py1.xlsx')

   name city  pin
0  dave  vad   32
1   sam  ahm   23
2  troy  sur   11

In [13]:
pd.read_csv(r"C:\Users\shmi2002\py2.tsv",sep='\t')

    Name  Phone no. batchno.
0  ALLEN   98070890  aksjn22
1    bob   28731971  kjasb28
2  Suzan   87231937  naksj21

In [14]:
pd.read_csv('https://raw.githubusercontent.com/dsrscientist/dataset1/master/bikes.csv')

           date  temperature   humidity  windspeed       count
0    2011-01-03     2.716070  45.715346  21.414957  120.000000
1    2011-01-04     2.896673  54.267219  15.136882  108.000000
2    2011-01-05     4.235654  45.697702  17.034578   82.000000
3    2011-01-06     3.112643  50.237349  10.091568   88.000000
4    2011-01-07     2.723918  49.144928  15.738204  148.000000
..          ...          ...        ...        ...         ...
186  2011-07-08    28.187490  63.618656  19.761499  692.000000
187  2011-07-09    29.070524  61.346450  21.121738  702.333333
188  2011-07-10    29.953558  59.074244  22.481976  712.666667
189  2011-07-11    30.836592  56.802038  23.842215  723.000000
190  2011-07-12    32.409522  52.521355  17.987135  662.000000

[191 rows x 5 columns]